# 1)კომენტარებით ახსენით განსხვევება indexing-სა და sliceing-ს შორის.

# 
# 



# 2)შექმენით სია სადაც გექნებათ 5 ელემენტი და მინუს ინდექსების გამოყენებით გამოიტანეთ ბოლო 3 ელემენტი

# maus = [ 3, False, 4.8, 7, 45]

# print  ( maus  [-3:])



# 3)შექმენით სია სადაც გექნებათ 10 რიცხვი, გადაუარეთ ამ სიას და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია ან ტოლია 10ზე




# nam = [972, 5 , 18 ,9 ,36, 8, 3, 5, 23, 93 ]

# for num in nam:
#     if num >=10:
#         print(num)




# 4) კომენტარის სახით ახსენით რა არის ფუქნცია, რაში ვიყენებთ და ჩამოწერეთ ყველა ნასწავლი ფუნქცია (გვერდით მიუწერეთ მათი დანიშნულება)

# ფუნქცია არის ისეთი რამ რასაც ფჩხილებიაქვს ბოლოში

# range()
# int()
# input()
# print()
# type()
# len()
# float()






# 5)(***BOSS LEVEL***) მომხმარებელს შემოატანინეთ მისი გვარი, შემდეგ შეეკითხეთ უნდა თუ არა რომ მისი გვარი გადაიყვანოს დიდ ასოებად, თუ გიპასუხათ 
# "yes" მაშინ დაუბეჭდეთ მისი სახელი დიდი ასოებით, თუ გიპასუხათ "no" დაუბეჭდეთ უბრალოდ მისი სახელი.
#  (მინიშნება: გაკვეთილის ბოლოს განვიხილეთ ზედაპირულად)











