// <!-- 1) ახსენით რა არის DOM'ი 

// DOM არის  JavaScript-ს დოკუმენტი რომელიც საშუალებას აძლევს ვებ-გვერდ***ებს გახდნენ ინტერაქტიული და დინამიური.

// 2) ჩამოწერეთ ყველა მათემატიკური ოპერაციები და ახსენით რას აკეთებენ ისინი 


// +, -, *, /, ++, --, **, %

// 3) შეასრულეთ მინიმუმ 3-3 მაგალითი თითოეულ მათემატიკურ ოპერაციაზე და გამოიტანეთ კონსოლში 

// დამატება

console.log(3 + 5);   
console.log(10 + 2);  
console.log(-7 + 4);  

// გამოკლება

console.log(10 - 4);  
console.log(25 - 12);
console.log(-3 - 6); 

// გამრავლება

console.log(6 * 7);  
console.log(3 * 9);   
console.log(-2 * 8);  

// გაყოფა

console.log(15 / 3);  
console.log(20 / 4);  
console.log(10 / -2); 

// ხარისხში აყვანა

console.log(2 ** 3);   
console.log(5 ** 2);   
console.log(3 ** 2);

// ნაშთიანი გაყოფა

console.log(43 % 3);   
console.log(5 % 2);   
console.log(3 % 2);

