# 1)შექმენით სია რომელშიც იქნება 5 სახელი შემდეგ, ამოიღეთ სიიდან პირველი და ბოლო ელემე

names = ["Data", "Vano,", "Deme", "Ana", "Saba"]

names.pop(0)


print(names)

# 2)კომეტარებით ახსენით რას აკეთებს თითოეული ფუნქცია:

# .insert()
# .append()
# .pop()
# .len()


# len :ვიგებთ სიის ელემენტების რაოდენობას
# .append: სიაში ვამატებთ ახალ ელემენტს
# .insert: კონკრეტულ ინდექსზე ვსვამთ ელემენტს
# .pop: ვშლით კონკრეტულ ინდექსზე მყოფ ელემენტს






# 3) შექმენით სია რომელიც შედგება 5 სახელისგან შემდეგ insert მეთოდით დაამატეთ ახალი სახელი სიის მეორე ინდექსზე


# names = ["data",  "vano", "deme", "saba", "tedo"]

# names.insert( 2,  "zvizdi" )

# print(names)



