# 2) კომენტარის სახით ჩამოწერეთ თუ რა განსხვავებაა set-ებსა და list-ებს შორის.

# set არის კოლექცია რომელიც არის დაულაგებელი,შეუცვლელი და არ დაიშვება ორი ან მეტი ერთნაირი ელემენტი

# list არის მოწესრიგებული თანმიმდევრობა. ეს ნიშნავს, რომ ელემენტები ინახება იმ თანმიმდევრობით, რომლითაც ისინი დაემატა.



# 3) შექმენით set სადაც შეინახავთ რიცხვებს, შემდეგ კი ინდექსინგის საშუალებით სცადეთ თითოეული ელემენტის შეცვლა და დააკვირდით შედეგს.

# 

# 4) შექმენით set, რომელშიც შენახული გექნებათ Fast food საკვები პროდუქტები. 
# შემდეგ კი ამოშალეთ ყველა პირვანდელი ელემენტები set-იდან, და მათ ნაცვლად დაამატეთ ჯანსაღი საკვები პროდუქტები.

fast_food = {"burger", "pizza", "hod dog"}

fast_food.remove("burger")
fast_food.remove("pizza") 
fast_food.remove("hod dog") 

fast_food.add("apple")
fast_food.add("bannana")
fast_food.add("milk")

print(fast_food)