# 2) კომენტარის სახით ჩამოწერეთ თუ რა განსხვავებაა set-ებსა და list-ებს შორის.

# set არის კოლექცია რომელიც არის დაულაგებელი,შეუცვლელი და არ დაიშვება ორი ან მეტი ერთნაირი ელემენტი

# list არის მოწესრიგებული თანმიმდევრობა. ეს ნიშნავს, რომ ელემენტები ინახება იმ თანმიმდევრობით, რომლითაც ისინი დაემატა.



# 3) შექმენით set სადაც შეინახავთ რიცხვებს, შემდეგ კი ინდექსინგის საშუალებით სცადეთ თითოეული ელემენტის შეცვლა და დააკვირდით შედეგს.

# set არის შეუცვლელი


# 4) შექმენით set, რომელშიც შენახული გექნებათ Fast food საკვები პროდუქტები. 
# შემდეგ კი ამოშალეთ ყველა პირვანდელი ელემენტები set-იდან, და მათ ნაცვლად დაამატეთ ჯანსაღი საკვები პროდუქტები.

fast_food_set = {"ჰამბურგერი", "პიცა", "კარტოფილი ფრი", "ჰოთ-დოგი", "ჩიზბურგერი"}


fast_food_set.clear()


fast_food_set.add("სალათი")
fast_food_set.add("ხილი")
fast_food_set.add("ბოსტნეული")
fast_food_set.add("თევზი")
fast_food_set.add("ქათმის გულ-მკერდი")

print(fast_food_set)