# 1) კომენტარის სახით ახსენით, თუ რა განასხვავებს tuple-ებს List-ებისგან.

# tuple არის შეუცვლელი List განსხვავებით

# List-ის შეცვლა კი შეიძლება

# 2) შექმენით tuple, რომელიც შეიცავს თქვენს 5 საყვარელ ფილმს,
#  შემდეგ კი დაბეჭდეთ პირველი და ბოლო ელემენტი ამ tuple-დან.

films = ("ჰარი პოტერი", "მელოტი ძიძა", "მარველის თამაშები", "მარტო სახლში", "მატყუარა მატყუარა")

print(films[0])
print(films[-1])

# დავიწყე მაგრამ ვერ გავაკეთე

# 3) შემენით Tuple, რომელშიც შეინახავთ კვირის დღეებს და 
# მოახდინეთ მათი unpacking (destruction),რათა მიანიჭოთ 
# თითოეული ელემენტი ცალკეულ ცვლადებს და დაბეჭდეთ ეს ცვლადები.

week = ("ორშაბათი", "სამშაბათი","ოთხშაბათი","ხუთშაბათი","პარასკევი", "შაბათი", "კვირა" )

(o, s, o1, x, p, S, k) = week

print(o)
print(s)
print(o1)
print(x)
print(p)
print(S)
print(k)

# 4) შექმენით tuple, რომელიც შეიცავს რამდენიმე 
# ელემენტს. შემდეგ შეამოწმეთ,
#  შეიცავს თუ არა ეს tuple კონკრეტულ ელემენტს

# NO

# 5) მოცემულია tuple = ("banana", "cherry", "strawberry", "raspberry") 
# (first, *second, third) = fruits

# რას გამოიტანს შემდეგი კოდი?
# print(first)
# print(second)
# print(third)

"banana"
["cherry" "strawberry"]
"raspberry"