# 1) შექმენით სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.


number = [26, 36, 53, 32, 4, 65, 23, 9, 34, 932, ]
sum = 1

for i in number:
    sum += i

print(sum)


























# 3)შექმენით სია სადაც იქნება ხუთი რიცხვი, გადაუარეთ ამ სიას for
#  ციკლის საშუალებით და შეამოწმეთ თუ სიიდან რომელიმე რიცხვი ნაკლებია 5ზე დავბეჭდოთ ის რიცხვი.

# maus = [2, 5 , 73 ,34 ,3,]

# for i in maus:
#     print(i)
#     if i < 5 :
#         print("hello")





# 4)შექმენით სია სადაც იქნება 10 რიცხვი და შექმენით sum ცვლადი რომლის საშუალებითაც გამოითვლით ამ ყველა რიცხვის ჯამს.


number = [26, 36, 53, 32, 4, 65, 23, 9, 34, 932, ]
sum = 0

for i in number:
    sum += i

print(sum)























