# 1)შექმენით სია შემდგარი 10 ელემენტისგან, და გამოიტანეთ მხოლოდ კენტ ინდექსზე მდგომი ელემენტი

nambers = [28, "data", 5, True, 11, "deme", 83, 23, 98, "tedo",]

for i in range(10):
    if i % 2 == 1:
        print(nambers [i])




# 2)შექმენით სია რომელიც შედგება 5 რიცხვისგან, გადაუარეთ ამ სიას for ციკლით და შეაჯამეთ თითოეული რიცხვი, ბოლოს გამოიტანეთ ამ რიცხვების ჯამი 
# (დაგჭირდებათ ერთი დამატებითი დამთვლელი ცვლადი (ჯამის ცვლადი, რომელსაც თითოეული რიცხვი დაემატება ყოველ იტერაციაზე))


leptopi = [72, 82, 46, 192, 923]
for i in leptopi:
     print(i)