# 1)შექმენით ცარიელი სია და for ციკლის მეშვეობით ჩაამატეთ ყველა ლუწი რიცხვი 0დან 200მდე, ბოლოს დაბეჭდეთ სია.

# odd = []
# even = [] 

# for i in range(0, 200):
#     if i % 2 == 0:
#         even.append(i)
#     else:
#         odd.append

# print(odd)
# print(even)


# 2)შექმენით ცარიელი სია და for ციკლის მეშვოებით მომხმარებელს შეეკითხეთ მისი top 5 საყვარელი სახელი (ანუ ხუთჯერ input).







# 3)შექმენით სია 10 ელემენტით და გამოიტანეთ მხოლოდ კენტ ინდექსზე მდგომი ელემენტები.

# numbers = [14, 22, 39, 44, 58, 64, 71, 83, 945, 10,]

# for i in range(len(numbers)):
#     if i % 3 == 0:
#         print(numbers[i])
    
# 4)შექმენით ცვლადი რომელშიც შენახული იქნება სტრინგი შემდეგ კი გაიგეთ ამ სტრინგის სიმბოლოების რაოდენობა.

# GOA = "javaskripti"
# print(len(GOA))


# 5)შექმენით სია შემდგარი 5 ელემენტისგან, მომხმარებელს შემოატანინეთ რიცხვი და სიიდან ამოაგდეთ შემოტანილ რიცხვის ინდექსზე მდგომი ელემენტი.

# vashli = ["data", "banani", True, "limoni", False]

# num = int(input("please enter a number:"))

# print(vashli[num])





# 6)შექმენით სია და დაბეჭდეთ ამ სიის სიგრძე.

# names = ["data", "deme", "saba", "vano", "nika", "nugzari"]

# print(len(names))



