# 1)შექმენით ფუნქცია რომელსაც გადაეცემა ორი რიცხვი შემდეგ დააბრუნეთ მათი ნამრავლი return ის გამოყენებით

def product( num1,num2 ):
    return num1 * num2 

print(product(10 , 3) )

# 2)ახსენით რაც დღეს გავიარეთ (isalnum,isdigit,islower,isnumeric,isupper,count) მეთოდები თითოეული რას აკეთებს.

#  isalnum:ვიჩვენებს True  როცა სცრინგში არის ან ასო ან რიცხვი
#  isdigit:აბრუნებს True  როცა სტრინგი მცხოლოდ რიცხვებისაგან შესდგება
#  islower:გვიჩვენებს True  როცა სტრინგი პატარა ასოებისგან შესდგება
#  isnumeric:
#  isupper:აბრუნებს True  როცა სტრინგი შეიცავს მხოლოდ დიდ ასოებს
#  count:გვიჩვენებს თუ რამდენჯერ არის განმეორებული ასო სტრინგში  

# 3)ასევე ახსენით რას აკეთებს min და max ჩაშენებული ფუნქციები

# max:აჩვენებს მაქსიმალურს
# min:აჩვენებს მინიმალურს   

